const questions = [
    {
        text: "Что такое хлорофилл?",
        options: ["Пигмент", "Фермент", "Гормон"],
        correct: 0,
        topic: "botany"
    },
    {
        text: "Какой органоид отвечает за дыхание клетки?",
        options: ["Митохондрии", "Хлоропласты", "Ядро"],
        correct: 0,
        topic: "zoology"
    },
    {
        text: "Что такое фотосинтез?",
        options: [
            "Процесс создания органических веществ",
            "Процесс разложения органики",
            "Процесс дыхания растений"
        ],
        correct: 0,
        topic: "botany"
    },
    {
        text: "Как называется наука о животных?",
        options: ["Зоология", "Ботаника", "Экология"],
        correct: 0,
        topic: "zoology"
    }
];
